app/Models/ModelLokasi.php

INSERT INTO `tbl_lokasi` (`nama_lokasi`, `alamat_lokasi`, `latitude`, `longitude`, `foto_lokasi`) VALUES ('psdku', 'psdku', '-0.505333501392411', '100.77985249052725', '1780380655_ef9c48552aef5117f05f.png')
---
    public function insertData($data)
    {
        $this->db->table('tbl_lokasi')->insert($data);

SELECT *
FROM `tbl_lokasi`
---
    public function getAllData()
    {
        return $this->db->table('tbl_lokasi')
        ->get()->getResultArray();

DELETE FROM `tbl_lokasi`
WHERE `id_lokasi` = '1'
AND `id_lokasi` = '1'
---
    public function deleteData($data)
    {
        $this->db->table('tbl_lokasi')
             ->where('id_lokasi',$data['id_lokasi'])
            ->delete($data);